app/Http/Controllers/Api/ContactController.php

    public function store(Request $request)
    {
        $request->validate([
            'name' => 'required|string|max:255',
            'email' => 'required|email|unique:contacts,email',
            'phone' => 'nullable|string|max:20',
            'message' => 'nullable|string',
            'address' => 'nullable|string|max:255',
        ]);

        $contact = Contact::create($request->all());
---
insert into `contacts` (`name`, `email`, `phone`, `message`, `address`, `updated_at`, `created_at`) values ('Nguyễn Văn A', 'nguyenvana@example.com', '0123456789', 'Tôi muốn biết thêm thông tin.', '123 Đường ABC, Quận 1, TP.HCM', '2025-03-14 15:39:42', '2025-03-14 15:39:42')

    public function update(Request $request, Contact $contact)
    {
        $request->validate([
            'name' => 'sometimes|required|string|max:255',
            'email' => 'sometimes|required|email|unique:contacts,email,' . $contact->id,
            'phone' => 'nullable|string|max:20',
            'message' => 'nullable|string',
            'address' => 'nullable|string|max:255',
            'status' => 'required'
        ]);

        $contact->update($request->all());
---
update `contacts` set `status` = 'Đã xử lý', `contacts`.`updated_at` = '2025-03-14 15:44:00' where `id` = 1