app/Http/Controllers/Api/TicketController.php

select * from `tickets`
---
    public function index()
    {
        return response()->json(Ticket::all(), 200);

select * from `tickets` where `code` = 'filter' limit 1
---
    public function show($code)
    {
        // Tìm vé theo code
        $ticket = Ticket::where('code', $code)
            ->with(['user', 'cinema', 'room', 'movie', 'showtime', 'ticketSeats.seat', 'ticketCombos.combo.foods'])
            ->first();